Revit 2024 API
BuiltInFailures.FamilyFailures.CannotConvertInstWorkPlaneToHost Property
 Can't convert Instance's Work Plane to Host. Try resetting Work Plane to a Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotConvertInstWorkPlaneToHost { get; }
Visual Basic
Public Shared ReadOnly Property CannotConvertInstWorkPlaneToHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotConvertInstWorkPlaneToHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace